In [1]:
import numpy as np
import pandas as pd

In [2]:
import csv

In [4]:
with open('EMPLOYEE.csv', 'r', newline='') as csv_file:
    csv_reader = csv.reader(csv_file)
        
    # Skip the header row if present
    next(csv_reader)
        
    # Iterate through the rows in the .csv file
    for row in csv_reader:
        # Extract data from the row
        Fname = row[0].strip("'")
        Minit = row[1].strip("'")
        Lname = row[2].strip("'")
        Ssn = row[3].strip("'")
            
        # Check if there are enough values in the row
        if len(row) >= 5:
            Bdate_str = row[4].strip("'")
        else:
            Bdate_str = ""
            
        # Check if there are enough values in the row
        if len(row) >= 6:
            Address = row[5].strip("'")
        else:
            Address = ""
            
        # Check if there are enough values in the row
        if len(row) >= 7:
            Sex = row[6].strip("'")
        else:
            Sex = ""
            
        # Check if there are enough values in the row
        if len(row) >= 8:
            Salary = float(row[7].strip("'")) if row[7].strip("'") != "null" else None
        else:
            Salary = None
            
        # Check if there are enough values in the row
        if len(row) >= 9:
            Super_ssn = row[8].strip("'") if row[8].strip("'") != "null" else None
        else:
            Super_ssn = None
            
        # Check if there are enough values in the row
        if len(row) >= 10:
            Dno = int(row[9])
        else:
            Dno = None

ValueError: could not convert string to float: 'TX'

In [56]:
with open('EMPLOYEE.csv', 'r', newline='\n') as csv_file:
    csv_reader = csv.reader(csv_file)
    for row in csv_reader:
        Fname = row[0]
        Minit = row[1]
        Lname = row[2]
        Ssn = row[3]
        Birthday = row[4]
        address = row[5]
        Sex = row[6]
        Salary = row[7]
        Super_ssn = row[8]
        Dno = row[9]
        i = row[10]

In [50]:
temp = row[5] + " " +row[6] + " " + row[7]

In [51]:
temp = temp.replace("'","")

In [52]:
temp

' 13 Fifth St Seattle WA'

In [76]:
Birthday = Birthday.replace("'","")
Birthday = Birthday.replace(" ","")

In [77]:
Birthday

'27-MAY-1978'

In [80]:
from datetime import datetime

In [81]:
Birthday = datetime.strptime(Birthday.strip(), '%d-%b-%Y').date()

In [82]:
Birthday

datetime.date(1978, 5, 27)

In [89]:
Address = row[5] + " " +row[6] + " " + row[7]

In [90]:
Address = Address.replace("'", "")
#Address = Address.replace(" ","")

In [93]:
Sex = row[8]

In [101]:
Salary = row[9]

In [104]:
Salary = float(Salary)

In [106]:
Salary = round(Salary, 2)

In [109]:
Super_ssn = row[10]

In [110]:
Super_ssn = Super_ssn.replace("'","")
Super_ssn = Super_ssn.replace(" ","")

In [112]:
Dno = row[11]

In [114]:
Dno = Dno.replace("'","")
Dno = Dno.replace(" ","")
Dno = int(Dno)

In [115]:
Dno

5

In [116]:
with open('DEPARTMENT.csv', 'r', newline='\n') as csv_file:
    csv_reader = csv.reader(csv_file)
    for row in csv_reader:
        Dname = row[0]
        Dno = row[1]
        Mgr_ssn = row[2]
        Mgr_start_date = row[3]

In [127]:
Mgr_start_date

" '2-FEB-2010'"

In [128]:
Mgr_start_date = Mgr_start_date.replace("'","")
Mgr_start_date = Mgr_start_date.replace(" ","")

In [130]:
Mgr_start_date = datetime.strptime(Mgr_start_date.strip(), '%d-%b-%Y').date()

In [131]:
Mgr_start_date

datetime.date(2010, 2, 2)

In [132]:
import pandas as pd

In [136]:
pd.read_csv("EMPLOYEE.csv", names = ['Fname', 'Minit', 'Lname', 'Ssn', 'Bdate', 'Address', 'Sex', 'Salary', 'Super_ssn', 'Dno'])

                       Fname         Minit           Lname               Ssn  \
'James'      'E'    'Jordan'   '888665151'   '10-NOV-1927'        '450 Stone
'Frank'      'T'      'Wong'   '333445555'   '08-DEC-1945'         '638 Voss
'Jennifer'   'S'   'Wallace'   '987654321'   '20-JUN-1931'        '291 Berry
'Jared'      'D'     'James'   '111111100'   '10-OCT-1966'      '123 Peachtr
'Alex'       'D'     'Freed'   '444444400'   '09-OCT-1950'   '4333 Pillsbury
...                      ...           ...             ...               ...
             'C'        'Yu'   '001614905'   '17-OCT-1980'      '626 Mary St
'Richard'    'T'   'Koelbel'   '214370999'    '3-APR-1976'        '50 Elk St
'Christina'  'S'     'Hisel'   '241625699'    '5-JUL-1986'    '37 Church Row
'Percy'      'M'     'Liang'   '398172999'   '12-JUN-1991'      '14 Maple St
'James'      'U'    'Miller'   '906218888'   '27-MAY-1978'      '13 Fifth St

                      Bdate Address   Sex  Salary     Super_ssn  Dno
'James'      'E'    Houston     TX'   'M'   55000          null    1
'Frank'      'T'    Houston     TX'   'M'   40000   '888665555'    5
'Jennifer'   'S'   Bellaire     TX'   'F'   43000   '888665555'    4
'Jared'      'D'    Atlanta     GA'   'M'   85000          null    6
'Alex'       'D'  Milwaukee     WI'   'M'   89000          null    7
...                     ...     ...   ...     ...           ...  ...
             'C'     Dallas     TX'   'M'   50000   '444444400'    6
'Richard'    'T'    Chicago     IL'   'M'   85000   '999999999'    4
'Christina'  'S'  Rochester     NY'   'F'   45000   '123456789'    6
'Percy'      'M'     Austin     TX'   'M'   55000          null    9
'James'      'U'    Seattle     WA'   'M'   75000   '999999999'    5

[70 rows x 10 columns]

In [137]:
pd.read_csv("PROJECT.csv")

         'EntityAnnot'   4      'Houston'   5
0           'Analysis'   5   'Sacramento'   6
1    'EventManagement'   6   'Sacramento'   6
2   'FoodDistribution'   7   'Sacramento'   6
3    'Computerization'  10     'Stafford'   4
4         'ConfigMgmt'  11      'Atlanta'   6
5         'DataMining'  13   'Sacramento'   6
6     'Reorganization'  20      'Houston'   1
7           'Benefits'  30     'Stafford'   4
8    'OperatingSystem'  61   'Sacramento'   6
9    'DatabaseSystems'  62      'Atlanta'   6
10        'Middleware'  63      'Atlanta'   6
11       'Advertizing'  70    'Arlington'   9
12    'InkjetPrinters'  91    'Milwaukee'   7
13     'LaserPrinters'  92    'Milwaukee'   7
14     'HumanResource'  95    'Arlington'   9
15      'SearchEngine'  22    'Arlington'   6
16       'MotherBoard'  29    'Milwaukee'   7

In [1]:
import pandas as pd

In [2]:
pd.read_csv("WORKS_ON.csv")

    '123456789'   5   32.5
0   '123456789'   6    7.5
1   '666884444'   7   40.0
2   '453453453'   5   20.0
3   '453453453'   6   20.0
4   '333445555'   7   10.0
..          ...  ..    ...
92  '349273344'   6   10.0
93  '242916639'   7   10.0
94  '214370999'   5    4.0
95  '111422203'   6    5.0
96  '398172999'   7   10.0

[97 rows x 3 columns]

In [3]:
pd.read_csv("PROJECT.csv")

         'EntityAnnot'   4      'Houston'   5
0           'Analysis'   5   'Sacramento'   6
1    'EventManagement'   6   'Sacramento'   6
2   'FoodDistribution'   7   'Sacramento'   6
3    'Computerization'  10     'Stafford'   4
4         'ConfigMgmt'  11      'Atlanta'   6
5         'DataMining'  13   'Sacramento'   6
6     'Reorganization'  20      'Houston'   1
7           'Benefits'  30     'Stafford'   4
8    'OperatingSystem'  61   'Sacramento'   6
9    'DatabaseSystems'  62      'Atlanta'   6
10        'Middleware'  63      'Atlanta'   6
11       'Advertizing'  70    'Arlington'   9
12    'InkjetPrinters'  91    'Milwaukee'   7
13     'LaserPrinters'  92    'Milwaukee'   7
14     'HumanResource'  95    'Arlington'   9
15      'SearchEngine'  22    'Arlington'   6
16       'MotherBoard'  29    'Milwaukee'   7

In [5]:
df = pd.read_csv("DEPENDENT.csv")

In [6]:
df.isnull()

    '888665151'   'Mary Alice'    'F'   '10-NOV-1924'   'Spouse'
0         False          False  False           False      False
1         False          False  False           False      False
2         False          False  False           False      False
3         False          False  False           False      False
4         False          False  False           False      False
5         False          False  False           False      False
6         False          False  False           False      False
7         False          False  False           False      False
8         False          False  False           False      False
9         False          False  False           False      False
10        False          False  False           False      False
11        False          False  False           False      False
12        False          False  False           False      False
13        False          False  False           False      False
14        False          False  False           False      False
15        False          False  False           False      False
16        False          False  False           False      False
17        False          False  False           False      False
18        False          False  False           False      False
19        False          False  False           False      False
20        False          False  False           False      False